request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pok="http://bankaya.com/soap/pokemon/v1">
  <soapenv:Header/>
  <soapenv:Body>
    <pok:getPokemonNameRequest>
      <pok:pokemonName>pikafdchu</pok:pokemonName>
    </pok:getPokemonNameRequest>
  </soapenv:Body>
</soapenv:Envelope>